<?php

return [
    'required' => 'حقل :attribute مطلوب.', 'email' => 'يجب أن يكون حقل :attribute بريداً إلكترونياً صالحاً.',
    'confirmed' => 'تأكيد حقل :attribute غير مطابق.', 'unique' => 'هذه القيمة مستخدمة من قبل.',
    'exists' => 'القيمة المحددة غير صالحة.', 'date' => 'يجب أن يكون حقل :attribute تاريخاً صالحاً.',
    'numeric' => 'يجب أن يكون حقل :attribute رقماً.', 'integer' => 'يجب أن يكون حقل :attribute عدداً صحيحاً.',
    'min' => ['numeric' => 'يجب ألا يقل حقل :attribute عن :min.', 'string' => 'يجب ألا يقل حقل :attribute عن :min أحرف.', 'array' => 'يجب أن يحتوي حقل :attribute على :min عناصر على الأقل.', 'file' => 'يجب ألا يقل حجم ملف :attribute عن :min كيلوبايت.'],
    'max' => ['numeric' => 'يجب ألا يتجاوز حقل :attribute القيمة :max.', 'string' => 'يجب ألا يتجاوز حقل :attribute عدد :max أحرف.', 'array' => 'يجب ألا يتجاوز حقل :attribute عدد :max عناصر.', 'file' => 'يجب ألا يتجاوز حجم ملف :attribute مقدار :max كيلوبايت.'],
    'image' => 'يجب أن يكون ملف :attribute صورة.', 'mimes' => 'يجب أن يكون ملف :attribute من نوع :values.',
    'password' => ['letters' => 'يجب أن تحتوي كلمة المرور على حرف واحد على الأقل.', 'mixed' => 'يجب أن تحتوي كلمة المرور على أحرف كبيرة وصغيرة.', 'numbers' => 'يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.', 'symbols' => 'يجب أن تحتوي كلمة المرور على رمز واحد على الأقل.', 'uncompromised' => 'ظهرت كلمة المرور هذه في تسريب بيانات. اختر كلمة أخرى.'],
];
